In [1]:
import numpy as np
import pandas as pd
from pandas import Series ,DataFrame

! pip install Pandas

Requirement already satisfied: Pandas in d:\ananconda\lib\site-packages (1.1.3)
Requirement already satisfied: pytz>=2017.2 in d:\ananconda\lib\site-packages (from Pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in d:\ananconda\lib\site-packages (from Pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in d:\ananconda\lib\site-packages (from Pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in d:\ananconda\lib\site-packages (from python-dateutil>=2.7.3->Pandas) (1.15.0)

In [2]:
# Agenda

age_df=pd.read_clipboard()
print(age_df)

  First name    Last name  Age
0       Tinu     Elejogun   14
1      Marek  Kostrzewski   25
2       Lily    McGarrett   18
3  Olatunkbo     Chijiaku   22
4   Adrienne     Anthoula   22
5     Axelia   Athanasios   22
6  Jon-Kabat         Zinn   22
7    Thabang        Mosoa   15
8   Kgaogelo        Mosoa   11

In [3]:
age_df=pd.read_clipboard()
print(age_df)

  First name    Last name  Age
0       Tinu     Elejogun   14
1      Marek  Kostrzewski   25
2       Lily    McGarrett   18
3  Olatunkbo     Chijiaku   22
4   Adrienne     Anthoula   22
5     Axelia   Athanasios   22
6  Jon-Kabat         Zinn   22
7    Thabang        Mosoa   15
8   Kgaogelo        Mosoa   11

In [4]:
age_df.columns

Index(['First name', 'Last name', 'Age'], dtype='object')

In [5]:

age_df=pd.read_clipboard()
print(age_df)

  First name    Last name  Age
0       Tinu     Elejogun   14
1      Marek  Kostrzewski   25
2       Lily    McGarrett   18
3  Olatunkbo     Chijiaku   22
4   Adrienne     Anthoula   22
5     Axelia   Athanasios   22
6  Jon-Kabat         Zinn   22
7    Thabang        Mosoa   15
8   Kgaogelo        Mosoa   11

In [6]:
age_df [['First name','Age']]

  First name  Age
0       Tinu   14
1      Marek   25
2       Lily   18
3  Olatunkbo   22
4   Adrienne   22
5     Axelia   22
6  Jon-Kabat   22
7    Thabang   15
8   Kgaogelo   11

In [7]:
age_df.columns

Index(['First name', 'Last name', 'Age'], dtype='object')

In [8]:
## Access one or more columns

age_df['First name']

0         Tinu
1        Marek
2         Lily
3    Olatunkbo
4     Adrienne
5       Axelia
6    Jon-Kabat
7      Thabang
8     Kgaogelo
Name: First name, dtype: object

In [9]:
# What is NAN Value
age_df['rank']=np.nan
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22   NaN
6  Jon-Kabat         Zinn   22   NaN
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11   NaN

In [10]:
age_df.head()

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN

In [11]:
age_df.tail()

  First name   Last name  Age  rank
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22   NaN
6  Jon-Kabat        Zinn   22   NaN
7    Thabang       Mosoa   15   NaN
8   Kgaogelo       Mosoa   11   NaN

In [12]:
# assign data set using Numpy Seris

array_1 =np.arange(9)
print(array_1)

[0 1 2 3 4 5 6 7 8]

In [13]:
age_df['rank']= array_1
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14     0
1      Marek  Kostrzewski   25     1
2       Lily    McGarrett   18     2
3  Olatunkbo     Chijiaku   22     3
4   Adrienne     Anthoula   22     4
5     Axelia   Athanasios   22     5
6  Jon-Kabat         Zinn   22     6
7    Thabang        Mosoa   15     7
8   Kgaogelo        Mosoa   11     8

In [16]:
# 2 .series
newrank_series = Series([10,11,12],index=[3,5,6])
age_df['rank'] = newrank_series
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22  10.0
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22  11.0
6  Jon-Kabat         Zinn   22  12.0
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11   NaN

In [17]:
# Delete a columns
del (age_df ['Last name'])
print(age_df)

  First name  Age  rank
0       Tinu   14   NaN
1      Marek   25   NaN
2       Lily   18   NaN
3  Olatunkbo   22  10.0
4   Adrienne   22   NaN
5     Axelia   22  11.0
6  Jon-Kabat   22  12.0
7    Thabang   15   NaN
8   Kgaogelo   11   NaN

In [18]:
# Convert Dictionery to a dataframe.
sample_dict = {'Company': ['Nestle','PG'],'Profit':[1000,759]}

print (sample_dict)

{'Company': ['Nestle', 'PG'], 'Profit': [1000, 759]}

In [21]:
sample_df =DataFrame (sample_dict)
print(sample_df)

  Company  Profit
0  Nestle    1000
1      PG     759